app/views/articles/show.html.erb

SELECT "categories".* FROM "categories"
---
<div class="field">
	<% @article.categories.each do |category| %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
	<ul id="comments-box">
		<% @article.comments.each do |comment| %>