app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		#all the registers from the DB
		#@articles = Article.publicados.ultimos

		#paginate is from the gem "will_paginate"
		@articles = Article.paginate(page: params[:page], per_page:10).publicados.ultimos

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2015-07-20 20:17:53.064105"], ["id", 9]]
---
	def show
		@article.update_visits_count

SELECT "categories".* FROM "categories"
---
	def new
		@article = Article.new
		@categories = Category.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tercer articulo"], ["body", "Este es un nuevo artículo :'v"], ["created_at", "2015-07-18 20:47:38.060546"], ["updated_at", "2015-07-18 20:47:38.060546"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 4], ["article_id", 14], ["created_at", "2015-07-22 21:50:02.994524"], ["updated_at", "2015-07-22 21:50:02.994524"]]
---
	def create
		#First create the article with params
		@article = current_user.articles.new(article_params)
		@article.categories = params[:categories]

		if @article.save  #save the articles on the DataBase

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
---
	def destroy
		@article.destroy #Delete the object from the DB

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Primer artículo editado"], ["updated_at", "2015-07-18 23:35:11.561804"], ["id", 1]]
---
	def update
		if @article.update(article_params)