app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["body", "Hola, este es un comentario :)"], ["created_at", "2015-07-20 20:39:31.685206"], ["updated_at", "2015-07-20 20:39:31.685206"]]

    def set_article
      #father resource, object_id, in this case, article_id
      @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]