app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles"
---
  def dashboard
  	@articles = Article.all